---
kind: type
id: T:Autodesk.Revit.DB.Visual.WaterTintEnableType
source: html/b27beebd-a9f4-d48f-77a4-402b9a2e5ea4.htm
---
# Autodesk.Revit.DB.Visual.WaterTintEnableType

The enumerated type representing the permitted values for the asset property "WaterTintEnable" from the "Water" schema.

## Syntax (C#)
```csharp
public enum WaterTintEnableType
```